testCase/ballSwing/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "include/initialConditions"


dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{

    sides
    {
        type            omegaWallFunction;
        refValue        uniform 0;
        value           uniform $turbulentOmega;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    inlet
    {
        type            omegaWallFunction;
        refValue        uniform 0;
        value           uniform $turbulentOmega;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    outlet
    {
        type            omegaWallFunction;
        refValue        uniform 0;
        value           uniform $turbulentOmega;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    ballIn
    {
        type            omegaWallFunction;
        refValue        uniform 0;
        value           uniform $turbulentOmega;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }

    ballOut
    {
        type            overset;
    }

	frontAndBack
	{
		type empty;	
	}
	

}


// ************************************************************************* //
